insert into authors(surname, name, patronym)
values ('Достоевский', 'Федор', 'Михайлович'), ('Маркес', 'Габриэль Гарсия', ''), ('Дюморье', 'Дафна', ''),
       ('Готтлиб', 'Лори', ''), ('Тартт', 'Дона', '');

insert into genres(name)
values ('роман'), ('магический реализм'), ('триллер'), ('детектив'), ('трагедия'), ('психология'), ('фантастика');

insert into books(name, author_id)
values ('Вы хотите поговорить об этом?', 4), ('100 лет одиночества', 2), ('Щегол', 5), ('Ребекка', 3),
       ('Преступление и наказание', 1);

insert into books_genres(book_id, genre_id)
values (1, 6), (2, 1), (2, 2), (3, 7), (3, 1), (3, 3), (3, 5), (4, 1), (4, 3), (4, 4), (4, 5), (5, 1);
